{
  "description": "Checklist for any website to ensure it's safe and secure for both the user and the business.",
  "items":[{"item":"Website is served only over https","data_type":"yes/no","category":"Security","severity":"High","additional_description":"This prevents data from being manipulated or intercepted"},{"item":"HSTS http-header set","data_type":"yes/no","category":"Security","severity":"High","additional_description":"Installing a Strict-Transport-Security header, it would be extremely difficult for attackers to steal data"},{"item":"Is the server certificate 4096 bits or more?","data_type":"yes/no","category":"Encryption","severity":"Low","additional_description":"Long-term future-proof key length is desired since the trouble of replacing signatures is pretty high"},{"item":"Is TLS1.2 the only supported protocol?","data_type":"yes/no","category":"Encryption","severity":"High","additional_description":"Through this security protocol, a system can communicate with the involved party. The encrypted data would not be deciphered by intruders"},{"item":"Supported symmetric ciphers use 256 bit keys or more","data_type":"yes/no","category":"Encryption","severity":"Medium","additional_description":"This bit size is the largest and it is unbreakable by brute force"},{"item":"Ensure your content cannot be embedded in a frame on other websites","data_type":"yes/no","category":"Security","severity":"High","additional_description":"Cross-domain iframes can run malicious apps, trigger alerts, autoplay videos, and induce phishing. "},{"item":"Deliver assets through a content delivery network","data_type":"yes/no","category":"Performance","severity":"Medium","additional_description":"This ensures fast delivery of Internet content"},{"item":"Ensure password entropy checks are carried out during sign-up","data_type":"yes/no","category":"Security","severity":"Medium","additional_description":"This predicts the difficulty quotient of cracking a password by guess work, brute force, and dictionary attacks"},{"item":"Store only hash of user passwords","data_type":"yes/no","category":"Security","severity":"High","additional_description":"Do not invent your own algorithm for repated hashing. Use PBKDF2, scrypt, or bcrypt"},{"item":"Ban IP addresses after a certain number of unsuccessful attempts","data_type":"yes/no","category":"Security","severity":"Medium","additional_description":"For high risk sites, it is advisable to block an IP address after n number of unsuccessful attempts. Also, redirect the users to a message explaining the block, such as \"malicious activity has been detected\""},{"item":"What are you using to control ssh login attempts?","data_type":"yes/no","category":"Security","severity":"Medium","additional_description":"The most common suggestion is to turn off daemon service, which is sometimes a default installation. Use alternate authentication methods, instead of simple passwords."},{"item":"Ensure hash salts, database passwords, and server signing keys are not checked into source control","data_type":"yes/no","category":"Security","severity":"High","additional_description":"This would throttle data breaches. Salt hash is the basis of secure password storage. By putting the passwords in source control, anyine who has access to the repository can see your data. "},{"item":"Unit tests to ensure one person cannot access another user's content","data_type":"yes/no","category":"Security","severity":"High","additional_description":"In a multi-tenant environment or role based access structure, authorization gets ignored and users via reverse engineering can get access to other user's data."},{"item":"Validate form fields with restrictive regex","data_type":"yes/no","category":"Data validation","severity":"Medium","additional_description":"Regular expressions or regex help in defining a whitelist for input validation. Input validation is the first line line of defense during the creation of a secure app"},{"item":"Do forms set a cross-site request forgery cookie?","data_type":"yes/no","category":"Security","severity":"High","additional_description":"Cross-site request forgery attacks force an end-user to carry unwanted actions on a site they are authenticated in"},{"item":"Do session cookies have the 'Secure' and 'HttpOnly' flag set?","data_type":"yes/no","category":"Security","severity":"High","additional_description":"Secure flags send the cookies only over HTTPS. HttpOnly flags prevents JavaScript from reading the cookies in case of XSS exploitation"}],
  "sources": [{"link":"https://github.com/mostafahussein/awesome-security-checklist"}]
}